### Проверить папку рута
```bash
  /root/.ssh/authorized_keys
```
если не создавал этот файл, удалить

### Проверить наличие лишних пользователей с шелом
```bash
cat /etc/passwd
```

Найти всех лишних пользователей у которых есть шел и удалить
***root:/bin/bash при только созданом сервере, этот пользователь должен быть один
/bin/sh
/bin/zsh
/bin/dash
  
Ищем всех которые не содержат
  /usr/sbin/nologin
  /bin/sync
  /bin/false
  
Находим пользователя и удаляем
```bash
userdel  user
```
Удалить пользователя с со всем барахлом, которое он хранил в папке
```bash
  userdel -r user
```
